# Дана статистика рекламных кампаний по дням.
# Напишите алгоритм, который по паре дата-кампания ищет значение численного столбца.
# Т. е. для даты '2018-01-01' и 'google' нужно получить число 25.
# Считайте, что все комбинации дата-кампания уникальны.

stats = [
    ['2018-01-01', 'google', 25],
    ['2018-01-01', 'yandex', 65],
    ['2018-01-01', 'market', 89],
    ['2018-01-02', 'google', 574],
    ['2018-01-02', 'yandex', 249],
    ['2018-01-02', 'market', 994],
    ['2018-01-03', 'google', 1843],
    ['2018-01-03', 'yandex', 1327],
    ['2018-01-03', 'market', 1764],
]